src/hibari/images-src/chain-fsm.dot
//
// Copyright (c) 2005-2011 Gemini Mobile Technologies, Inc.  All rights reserved.
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//

digraph data_flow {
    {rank=same; start unknown};
    {rank=same; stopped degraded};

    start [label="Start"];
    unknown [label="Unknown"];
    unknown_timeout [label="Timeout while Unknown"];
    stopped [label="Stopped"];
    degraded [label="Degraded"];
    healthy [label="Healthy"];

    start -> unknown;
    unknown -> unknown_timeout;
    unknown -> stopped;
    unknown -> degraded;
    unknown -> healthy;
    unknown_timeout -> stopped;
    unknown_timeout -> degraded;
    stopped -> degraded;
    stopped -> healthy;
    stopped -> unknown;
    degraded -> stopped;
    degraded -> healthy;
    degraded -> unknown;
    healthy -> stopped;
    healthy -> degraded;
    healthy -> unknown;
};
